
## Plan Result (aat)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.prl_pcq_token_key
* Update
  * module.prl-citizen-frontend-session-storage.azurerm_redis_cache.redis
* Move
  * module.application_insights.azurerm_monitor_activity_log_alert.main => module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.application_insights_preview[0].azurerm_monitor_activity_log_alert.main => module.application_insights_preview[0].azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.prl_pcq_token_key will be created
  + resource "azurerm_key_vault_secret" "prl_pcq_token_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.KeyVault/vaults/prl-aat"
      + name                    = "prl-pcq-token-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main has moved to module.application_insights.azurerm_monitor_activity_log_alert.main[0]
    resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - prl-appinsights-aat"
        name                = "Application Insights daily cap reached - prl-appinsights-aat"
        tags                = {
            "application"         = "family-private-law"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.application_insights_preview[0].azurerm_monitor_activity_log_alert.main has moved to module.application_insights_preview[0].azurerm_monitor_activity_log_alert.main[0]
    resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - prl-appinsights-preview"
        name                = "Application Insights daily cap reached - prl-appinsights-preview"
        tags                = {
            "application"         = "family-private-law"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.prl-citizen-frontend-session-storage.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-citizen-frontend-redis-cache-aat/providers/Microsoft.Cache/redis/prl-citizen-frontend-redis-aat"
        name                          = "prl-citizen-frontend-redis-aat"
        tags                          = {
            "application"         = "family-private-law"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved = 125 -> 642
          ~ maxmemory_delta                 = 125 -> 642
          ~ maxmemory_reserved              = 125 -> 642
            # (11 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":35,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->